"""__author__=余婷"""
# 1.变量
"""
变量名 = 值

变量名1 = 变量名2 = 变量名3 = ... = 值
变量名1,变量名2,... = 值1, 值2, ...
"""

# 2.运算符
"""
+,-,*,/,%,//,** 
>, <, ==, !=, >=, <=
and, or, not
=, +=, -=, *=, /=, %=, //=, **=

&,|,~,^,<<,>>(了解!)
"""

# 3.分支结构
"""
if结构：

if 条件语句:
    代码段
    
    
if 条件语句:
    代码段1
else:
    代码段2

"""

# 4.输入年，写代码判断输入的年是否是闰年，如果是输出'闰年',否则输出'不是闰年'
# 闰年的条件: 1)能被4整除但是不能被100整除 2)能被400整除
year = int(input('请输入年份:'))
if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
    print(year, '是闰年')
else:
    print(year, '不是闰年')


# 5.今天上课讲了15000秒的课，编程计算今天上课时间是多少小时，多少分钟，多少秒；以‘XX时XX分XX秒’的方式表示。
# 例如: 时间67秒 —> 0时1分7秒
time = 3601
h = time // (60*60)
m = time % (60*60) // 60
s = time % 60
print(h, "时", m, '分', s, '秒')


# 6. 定义两个变量保存一个人的身高和体重，编程实现判断这个人的身材是否正常!
# 公式: 体重(kg)/身高(m)的平方值在18.5 ~ 24.9之间属于正常。
height = 1.55
weight = 50
value = weight / height**2
print(value)
if 18.5 <= value <= 24.9:
    print('正常')
else:
    print('不正常')

