"""__author__=吴佩隆"""
# 数字在编程中有4种表示方式：十进制、二进制、八进制、十六进制
# 1.十进制
# 基数:0,1,2,3,4,5,6,7,8,9
# 进位:逢10进1
# 位权:123 = 100 + 20 + 3  = 1*10**2 + 2*10**1 + 3*10**0
# 表示方式(python):直接写
# 转换:直接打印

# 2.二进制
# 基数:0,1
# 进位:逢2进1
# 位权:1011(2) = 1*2^0 +1*2^1+0*2^2+1*2^3 =11(10)
# 表示方式(python):二进制数前加0b/0B  num = 0b1011

# 3.八进制
# 基数:0,1,2,4,5,6,7
# 进位:逢8进1
# 位权:123(8) = 3*8^0+2*8^1+1*8*2 = 83
# 表示方式(python):八进制数前加0o/0O   0o123
# 转换:oct(其他进制数)

# 4.十六进制
# 基数:0,1,2,3,4,5,6,7,8,9,a(10),b(11),c(12),d(13),e(14),f(15)
# 进位:逢16进1
# 位权:1f(16) = 15*16^0+1*16^1 = 31(10)
# 表示方式(python):十六进制数前加0x/0X  0x1f
# 转换:hex(其他进制数)

# ======手动进制之间相互转换======
# 1.十进制转换成其他进制 - 辗转取余法(不断除2/8/16取余数)
# 2.其他进制转十进制 - 位权乘以对应位置上的基数然后求和
# 0b1011 -> 2^0 + 2^1 + 2^3 = 11
# 3.2，8，16进制互相转换
# 1 011 011(2) -> 133(8)
# 101 1011(2) -> 5b(16)
# 76(8) -> 111 110(2)
# a3(16) -> 1010 0011(2)
# a3(16) -> 10 100 011(2) -> 243(8)
