"""__author__=余婷"""
# 左移、右移、上移、下移、发射子弹、爆炸....

# 左移1次  右移1次  左移2次 右移3次  左移2次  右移2次
# 1.没有函数的时候的问题: a.同样的代码要写多次(冗余)  b.功能发生改变的时候需要修改多个位置的代码
# 2.解决问题: 用函数
# 3.函数的作用: 封装

def func1():
    sum1 = 0
    for x in range(101):
        sum1 += x
    print(sum1)

def func2():
    age = 19
    if age >= 18:
        print('成年')

def left():
    print('==============左移=================')
    print('看后视镜')
    print('向左打方向盘')
    # print('踩油门')
    print('回正方向盘')


def right():
    print('==============右移=================')
    print('看后视镜')
    print('向右打方向盘')
    # print('踩油门')
    print('回正方向盘')

left()
right()
left()
left()
right()
right()
right()
left()
left()
right()
right()
# print('==============左移=================')
# print('看后视镜')
# print('向左打方向盘')
# # print('踩油门')
# print('回正方向盘')
#
# print('==============右移=================')
# print('看后视镜')
# print('向右打方向盘')
# # print('踩油门')
# print('回正方向盘')
#
# print('==============左移=================')
# print('看后视镜')
# print('向左打方向盘')
# # print('踩油门')
# print('回正方向盘')
#
# print('==============左移=================')
# print('看后视镜')
# print('向左打方向盘')
# # print('踩油门')
# print('回正方向盘')
#
# print('==============右移=================')
# print('看后视镜')
# print('向右打方向盘')
# # print('踩油门')
# print('回正方向盘')
#
# print('==============右移=================')
# print('看后视镜')
# print('向右打方向盘')
# # print('踩油门')
# print('回正方向盘')
#
# print('==============右移=================')
# print('看后视镜')
# print('向右打方向盘')
# # print('踩油门')
# print('回正方向盘')
#
# print('==============左移=================')
# print('看后视镜')
# print('向左打方向盘')
# # print('踩油门')
# print('回正方向盘')
#
# print('==============左移=================')
# print('看后视镜')
# print('向左打方向盘')
# # print('踩油门')
# print('回正方向盘')
#
# print('==============右移=================')
# print('看后视镜')
# print('向右打方向盘')
# # print('踩油门')
# print('回正方向盘')
#
# print('==============右移=================')
# print('看后视镜')
# print('向右打方向盘')
# # print('踩油门')
# print('回正方向盘')



