"""__author__=吴佩隆"""

# 1.格式占位符
"""
a.语法: 包含格式占位符的字符串 % (值1,值2,值3...)
b.说明: 
格式占位符 - 格式占位符有哪些是固定的,使用的时候和字符串中变化的数据类型相关
%s - 字符串(任何类型都可以使用%s占位)
%d - 整数
%-Nd - 整数;N约束数字最后的长度,如果不够后面空格填充
%Nd                                前面空格填充
%f - 浮点数;小数点后面保留6位小数
%.Nf - 浮点数;小数点后面保留N位小数(四舍五入)
%c - 单个字符或数字,如果为数字为编码值可以自动转换

% - 固定写法
() - 固定写法;如果值的个数是1可以省略
值 - 任何有结果的表达式;值得个数和类型和前面占位符的个数以及类型保持一致
"""

name = '雷军'
age = 18
num1 = 1.257
print('我是%s,今年%-4d岁!' % (name, age))    # 我是雷军,今年18  岁!
print('我是%s,但被约束成%.2f了' % (num1, num1))     # 我是1.257,但被约束成1.26了
print('%c,%c' % ('z', 97))

# 2.format
"""
一个带有{}的字符串.format(值1,值2,值3...)

"""
# 用法1:让空的{}个数和format中值的个数保持一致
print('我是{},今年{}岁'.format('雷军', 34))  # 我是雷军,今年34岁

# 用法2:{N} - N从0开始依次增加,分别表示format中第0个值,第1个值...
print('我是{0},年龄是{1},今年{1}岁'.format('雷军', 34))  # 我是雷军,年龄是34,今年34岁
print('{1},{0},{1}'.format(10, 20))  # 20,10,20

# 用法3:{key}
# '{key1},{key2}'.format(key1=值1, key2=值2)
print('{name},{age}'.format(name='雷军', age=18))  # 雷军,18

# 用法4:用列表元素给占位符赋值
list1 = [10, 20, 30, 40]
print('{0[2]},{0[0]},{0[1]}'.format(list1))  # 30,10,20
print('{1[1]},{1[2]},{0}'.format('雷军', list1))  # 20,30,雷军

# 用法5:用字典的值给占位符赋值
student = {'name': '小明', 'age': 18, 'id': '001', 'score': 100}
print('{name}今年{age}岁,学号:{id},考了{score}'.format(**student))  # 小明今年18岁,学号:001,考了100
# format(**student) --> format(name='小明',age=18,id='001',score=100)

# 其他方法:
print('圆周率:{:.2f}'.format(3.141592653))  # 圆周率:3.14 约束小数点位数
print('整数:{:S>4d}B'.format(25))  # 整数:SS25B
print('整数:{:S<4d}B'.format(25))  # 整数:25SSB
print('整数:{:+>4d}B'.format(25))  # 整数:++25B
