"""__author__=吴佩隆"""

# lyrics = """
# [00:00.20]蓝莲花
# [00:00.80]没有什么能够阻挡
# [00:06.53]你对自由地向往
# [00:11.59]天马行空的生涯
# [00:16.53]你的心了无牵挂
# [02:11.27][01:50.22][00:21.95]穿过幽暗地岁月
# [02:16.51][01:55.46][00:26.83]也曾感到彷徨
# [02:21.81][02:00.60][00:32.30]当你低头地瞬间
# [02:26.79][02:05.72][00:37.16]才发觉脚下的路
# [02:32.17][00:42.69]心中那自由地世界
# [02:37.20][00:47.58]如此的清澈高远
# [02:42.32][00:52.72]盛开着永不凋零
# [02:47.83][00:57.47]蓝莲花
# """
#
#


# lyrics = """
# [00:00.00]中华大花园
# [00:02.50]作词：崔富
# [00:05.00]作曲：阿汝汗
# [00:07.50]演唱：乌兰图雅
# [00:10.00]LRC BY ：吉时雨
# [00:12.50]QQ：132 7269 041
# [00:15.00]www.22lrc.com ★
# [00:17.50]
# [01:31.26][00:21.43]塞北腊梅迎春来
# [01:34.52][00:24.54]岭南木棉展风采
# [01:37.91][00:28.01]中原牡丹添富贵
# [01:41.18][00:31.34]江南茉莉香四海
# [01:45.46][00:35.51]
# [01:46.15][00:36.15]雪域格桑舞翩跹
# [01:49.54][00:39.54]云贵山茶抒情怀
# [01:52.87][00:42.95]山丹染红大草原
# [01:56.26][00:46.23]雪莲放歌天山外
# [02:00.43][00:50.73]
# [02:41.10][02:00.97][00:51.32]中华大花园
# [02:44.44][02:04.49][00:54.45]兄弟姐妹笑颜开
# [02:47.92][02:07.90][00:57.96]中华大花园
# [02:51.19][02:11.15][01:01.23]梦想花开花如海
# [02:53.88][02:13.92][01:03.86]
# [02:54.50][02:14.51][01:04.52]中华大花园
# [02:57.68][02:17.79][01:07.89]兄弟姐妹笑颜开
# [03:01.16][02:21.23][01:11.27]中华大花园
# [03:07.78][03:04.47][02:24.50][01:14.56]梦想花开花如海
# [03:14.26][02:28.48][01:18.37]
# [10:00.00]LRC歌词下载：www.22lrc.com
# """
#
#
# class Lyrics:
#
#     def __init__(self: str, lyc):
#         self.lyc = lyc
#
#     def parsing(self):                                             # 解析函数
#         list1 = self.lyc.split('\n')                               # 去除换行符
#         list1 = [i for i in list1 if i != '']                      # 去除空元素
#         list1 = [i.strip() for i in list1]                         # 去除空格
#
#         list2 = [[float(i[j:j + 10][1:3] + i[j:j + 10][4:9]),      # 分析歌词切片成需要的列表
#                   i[i.rfind(']') + 1:]] for i in list1 for j \
#                  in range(len(i) - 9) if i[j] == '[']
#
#         list2.sort(key=lambda x: x[0])                             # 将列表以时间大小的顺序排列
#
#         return list2
#
#     def show_lyc(self, time1: str):                                # 显示函数
#         time1 = float(time1[0:2] + time1[3:])                      # 将输入的字符串转化成浮点以比较时间大小
#
#         for each in range(len(self.parsing())):                    # 遍历列表，找到大于输入时间的元素返回上一句歌词
#             if time1 <= self.parsing()[each][0]:
#                 return self.parsing()[each-1][1]
#
#
# a = Lyrics(lyrics)
#
# print(a.show_lyc('01:15.53'))
# print(a.show_lyc('02:15.60'))
# print(a.show_lyc('00:49.58'))


# class UR_SB_Error(Exception):
#     def __str__(self):
#         return '老子属性你也想看？？'
#
#
# class Person:
#     def __init__(self):
#         self.__name = ''
#         print('生有何欢~')
#
#     def __repr__(self):
#         return '打印老子干锤子？？'
#
#     @property
#     def name(self):
#         raise UR_SB_Error
#
#
# a = Person()
#
# print(a)




