"""__author__=吴佩隆"""

# 1.字典.clear() - 清空字典
dog = {'name': '大黄', 'age': 4, 'gender': '公狗', 'kind': '土狗'}
dog.clear()
print(dog)

# 2.字典.copy() - 拷贝字典，返回新字典
dog = {'name': '大黄', 'age': 4, 'gender': '公狗', 'kind': '土狗'}
dog2 = dog.copy()
print(dog2)

# 3.dict.fromkeys(序列,值) - 创建新字典
# 将序列中的元素作为key，指定的值作为每个key的value
dict1 = dict.fromkeys('abc', 100)
print(dict1)

# 4.字典.items()、字典.values()、字典.keys()
# 字典.key() -> 获取字典所有的key并且返回,返回的数据类型是序列但不是列表
# 字典.value() -> 获取字典所有的value并且返回,返回的数据类型是序列但不是列表
# 字典.items() -> 同时获取字典所有的key和value,返回一个序列,序列中元素是有两个元素的元组,key和value
dog = {'name': '大黄', 'age': 4, 'gender': '公狗', 'kind': '土狗'}
print(list(dog.keys()))  # ['name', 'age', 'gender', 'kind']
print(list(dog.values()))  # ['大黄', 4, '公狗', '土狗']
print(list(dog.items()))  # [('name', '大黄'), ('age', 4), ('gender', '公狗'), ('kind', '土狗')]

# 5.字典.setdefault(key,value) - 字典中添加键值对(key存在的时候不会修改)
dog = {'name': '大黄', 'age': 4, 'gender': '公狗', 'kind': '土狗'}
dog.setdefault('color', '黄色')
print(dog)
dog.setdefault('name', '小强')
print(dog)

# 6.字典1.update(字典2) - 将字典2中的键值对添加到字典1中
# 将字典2中的键值对更新到字典1中，存在就更新，不存在就添加
dog = {'name': '大黄', 'age': 4, 'gender': '公狗', 'kind': '土狗'}
dict2 = {'name': '小明', 'height': 170}
dog.update(dict2)
print(dog)

# 练习2:设计数据保存一个班的信息:班级名字、位置、所有的老师(名字、性别、QQ、职位)、
# 所有的学生(姓名、学校、电话、性别、年龄、紧急联系人(姓名、关系、联系方式)))

python_1906 = {'名字': 'python-1906',
               '位置': '力宝大厦18楼',
               '老师': [
                   {'名字': '', '性别': '', 'qq': '', '职位': ''},
                   {'名字': '', '性别': '', 'qq': '', '职位': ''}
               ],
               '学生': [
                   {'名字': '',
                    '学校': '',
                    '电话': '',
                    '性别': '',
                    '年龄': '',
                    '紧急联系人': {
                        '姓名': '',
                        '电话': '',
                        '关系': ''

                    },
                    }, {'名字': '',
                        '学校': '',
                        '电话': '',
                        '性别': '',
                        '年龄': '',
                        '紧急联系人': {
                            '姓名': '',
                            '电话': '',
                            '关系': ''

                        },
                        }, {'名字': '',
                            '学校': '',
                            '电话': '',
                            '性别': '',
                            '年龄': '',
                            '紧急联系人': {
                                '姓名': '',
                                '电话': '',
                                '关系': ''

                            },
                            }, {'名字': '',
                                '学校': '',
                                '电话': '',
                                '性别': '',
                                '年龄': '',
                                '紧急联系人': {
                                    '姓名': '',
                                    '电话': '',
                                    '关系': ''

                                },
                                }
               ]}
