"""__author__=余婷"""

# 1.格式占位符
"""
a.语法: 包含格式占位符的字符串 % (值1, 值2, 值3,...)  
b.说明:
格式占位符 - 格式占位符有哪些是固定，使用的时候和字符串中变化的数据的类型相关
           %s  - 字符串(任何类型都可以使用%s占位)
           %d  - 整数; 
           %-Nd - 整数; N约束数字最后的长度，如果不够后面补空格
           %Nd  - 整数; N约束数字最后的长度，如果不够前面补空格
           %f   - 浮点数；小数点后面保留6位小数
           %.Nf - 浮点数, N约束小数点N后的小数位数(会四舍五入)
           %c   - 字符
% - 固定写法
() - 固定写法;如果值的个数是1可以省略
值 - 任何有结果的表达式; 值的个数和类型和前面占位符的个数以及类型保持一致
"""
# name = input('请输入姓名:')
name = '张三'
# age = int(input('请输入年龄:'))
age = 20
# 你好，我是xxx，今年x岁
# 方法一:
print('你好，我是'+name+'，今年'+str(age)+'岁')
print('你好，我是%s，今年%4d岁, 工资:%.2f, %s, %f, %c, %c' % (name, age, 3.1495926, 2.348, 1.25, 'Z', 97))


# 2.format
"""
一个带有{}的字符串.format(值1, 值2, 值3,...)

"""
# 用法1: 让空的{}个数和format中值的个数保持
print('我是{}, 今年{}岁'.format('余婷', 18))

# 用法2: {N} - N从0开始依次增加，分别表示format中第0个值，第1个值,...
print('我是{0},年是:{1}, 今年{1}岁'.format('余婷', 18))
print('数据1:{1}, 数据2:{0}, 数据3:{1}'.format(10, 20))   # 数据1:20, 数据2:10, 数据3:20

# 用法3: [key]
# '{key1}, {key2}'.format(key1=值1, key2=值2)   -> '值1, 值2'
print('我是{name},年龄是:{age}, 今年{age}岁'.format(age=20, name='张三'))


# 用法4: 用列表元素给占位符赋值（了解）
list1 = [10, 20, 30, 40]
print('{0[1]},{0[0]},{0[3]}'.format(list1))
print('{1[0]}, {1[1]}, {1[1]}, {0}'.format('张三', list1))
print('{list[1]},{list[2]},{list[3]}'.format(name='张三', list=list1))

# 用法5: 用字典的值给占位符赋值(了解)
student = {'name': '小明', 'age': 20, 'id': '001', 'score': 100}
print('{name}今年{age}岁，学号:{id}, 考了{score}'.format(**student))
# format(**student) --> format(name='小明', age=20, id='001', score=100)

# 其他的写法:
# 约束小数位数
print('圆周率:{:.2f}'.format(3.1415926))   # 约束小数位数
# 约束整数宽度
print('整数:{:0>4d}。'.format(25))    # 整数:0025
print('整数:{:0<4d}。'.format(25))    # 整数:2500。
print('整数:{:+>4d}。'.format(25))    # 整数:++25。
# 分隔
print('大的整数:{:,}'.format(100000000))   # 大的整数:100,000,000
# 百分比
print('百分比:{:.2%}'.format(0.25))   # 百分比:25.00%


