"""__author__=吴佩隆"""

# 1.什么是递归函数
"""
声明函数的时候调用函数本身,这样的函数就是递归函数(自己调自己)
递归可以实现循环效果,原则上除了死循环,其他的循环递归都可以实现
"""


# def fun1():
#     print('=====')
#     fun1()
#
#
# fun1()


# 2.递归怎么用
"""
使用递归的套路:
a.设置临界值 - 循环结束的条件(保证函数结束)
b.找关系 - 找f(n)和f(n-1)的关系
c.假设函数功能已经实现,通过f(n-1)去实现f(n)的功能
"""


# 写一个递归函数,计算1+2+3....n
def sum1(n):
    # 找临界值
    if n == 1:
        return 1

    # 找关系
    """
    f(n) -> 1+2+3.....n-1+n
    f(n-1) -> 1+2+3...n-1
    f(n) = f(n-1) + n
    """

    # 用f(n-1)实现f(n)的功能
    return sum1(n-1) + n


print(sum1(10))


# 写一个递归函数,求斐波那契数列的第n个数
# 1,1,2,3,5,8,13.....

def series(n):
    if n == 1 or n == 2:
        return 1
    return series(n-1)+series(n-2)


print(series(5))


# 练习:
"""
n = 4
*
**
***
****
"""


def f(n):
    if n == 1:
        print('*')
        return
    f(n-1)
    print('*'*n)


f(5)


