"""__author__=余婷"""

# 数字在编程中有4种表示方式: 十进制、二进制、八进制、十六进制
# 1.十进制
# 基数: 0,1,2,3,4,5,6,7,8,9
# 进位: 逢10进1
# 位权: 123(10) = 100 + 20 + 3  = 1*10^2 + 2*10^1 + 3*10^0 == 123
# 表示方式(python): 直接写
# 转换: 直接打印
num1 = 123
num2 = 578


# 2.二进制
# 基数: 0, 1
# 进位：逢2进1   1+0 == 1；  0+1 == 1； 1+1 == 10
# 110 + 101 == 1011
# 位权: 1011(2) = 1*2^0 + 1*2^1 + 0*2^2 + 1*2^3 == 11(10)
# 表示方式(python): 二进制数前加0b/0B
# 转换: bin(其他进制的数字)
num3 = 0b1011
print(num3)

print(bin(100))

# 3.八进制
# 基数: 0,1,2,3,4,5,6,7
# 进位: 逢8进1
# 位权: 123(8) = 3*8^0 + 2*8^1 + 1*8^2 ==  3 + 16 + 64 = 83(10)
# 表示方式(python): 八进制数前加0o/0O
# 转换: oct(其他进制的数)
num4 = 0o123
print(num4)

# 4.十六进制
# 基数: 0,1,2,3,4,5,6,7,8,9, a(10), b(11), c(12), d(13), e(14), f(15)
# 进位: 逢16进1
# 位权: 1f(16) = 15*16^0 + 1*16^1 == 31(10)
# 表示方式(python): 十六进制数前加0x/0X
# 转换: hex(其他进制的数)

num5 = 0X1f
print(num5)

# ============(手动)进制之间的相互转换=========
# 1.十进制转换成其他进制 - 辗转取余法(不断的除2/8/16取余数)
# 2.其他的进制转十进制  -  位权乘以对应位置上的基数然后求和
# 0b1011 -> 2^0+2^1+2^3 = 11
# 3.二进制、八进制和十六进制之间的相互转换
# 1 011 011(2) -> 133(8)
# 101 1011(2) -> 5b(16)
# 76(8) -> 111 110(2)
# a3(16) -> 1010 0011(2)
# a3(16) -> 10 100 011(2) -> 243(8)
print(0b1011011)
print(0o133)

print(0xaf + 10)
print(175 + 10)












